app/controllers/home_controller.rb

SELECT "clients".* FROM "clients" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "clients"
---
  def index
    session[:number_per_page] = 10 if session[:number_per_page].blank?
    @item = Client.paginate(:page => 1, :per_page => session[:number_per_page])

INSERT INTO "clients" ("created_at", "description", "name", "server_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Thu, 07 Mar 2013 08:39:58 UTC +00:00], ["description", "Hello World"], ["name", "Shaton"], ["server_id", nil], ["updated_at", Thu, 07 Mar 2013 08:39:58 UTC +00:00]]
---
  def add_item
    Client.create(:name => params["name"], :description => params["description"])

DELETE FROM "clients" WHERE "clients"."id" = $1  [["id", 9]]
SELECT "clients".* FROM "clients" WHERE (id IN ('1'))
SELECT COUNT(*) FROM "clients"
---
  def remove_item
    session[:number_per_page] = params['per'] if !params['per'].blank?
    params[:page] = 1 if params[:page].blank?

    Client.destroy_all(["id IN (?)", params['list']])
    length = params['list'].length
    @clients = Client.simple_search(params)
    @client = @clients.paginate(:page => params['page'], :per_page => session[:number_per_page])

SELECT "clients".* FROM "clients" LIMIT 10 OFFSET 10
SELECT COUNT(*) FROM "clients"
---
  def item_per_page
    session[:number_per_page] = params['per'] if !params['per'].blank?
    params[:page] = 1 if params[:page].blank?

    @items = Client.simple_search(params)
    @item = @items.paginate(:page => params['page'], :per_page => session[:number_per_page])